app/controllers/page_controller.rb

  def index
    render json: Page.all
---
SELECT "pages".* FROM "pages"