app/controllers/pages_controller.rb

  def create
    @page = Page.new(page_params)

    if @page.save
---
INSERT INTO "pages" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "This is 3.423864462672559"], ["content", "Oh this is new..."], ["created_at", "2018-10-28 11:19:00.549906"], ["updated_at", "2018-10-28 11:19:00.549906"]]

  def update
    if @page.update(page_params)
---
UPDATE "pages" SET "title" = $1, "updated_at" = $2 WHERE "pages"."id" = $3  [["title", "Lion Air crash: Boeing 737 plane crashes in sea off Jakarta"], ["updated_at", "2018-10-29 10:31:03.837786"], ["id", 92]]